[Killed] BlockStatement
src/analyzers/centerExpansion.js:3:49
 const { validateInput } = require("./manacherOdd");
 
-function expandAroundCenter(input, left, right) {
-  // Stryker disable all: for string indexing in JS these guard mutations are observationally equivalent.
-  while (
-    left >= 0 &&
-    right < input.length &&
-    input[left] === input[right]
-  ) {
-    left -= 1;
-    right += 1;
-  }
-  // Stryker restore all
-
-  return {
-    start: left + 1,
-    end: right - 1,
-    length: right - left - 1
-  };
-}
+function expandAroundCenter(input, left, right) {}
 
 function centerExpansion(input) {
killedBy: centerExpansion корректно расширяет палиндром вокруг нечетного центра
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/analyzers/centerExpansion.js:15:10
   }
   // Stryker restore all
 
-  return {
-    start: left + 1,
-    end: right - 1,
-    length: right - left - 1
-  };
+  return {};
 }
 
killedBy: centerExpansion корректно расширяет палиндром вокруг нечетного центра
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0}
Received:
  {}

Message:

[Killed] ArithmeticOperator
src/analyzers/centerExpansion.js:16:12
   // Stryker restore all
 
   return {
-    start: left + 1,
+    start: left - 1,
     end: right - 1,
     length: right - left - 1
killedBy: centerExpansion корректно расширяет палиндром вокруг нечетного центра
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0}
Received:
  {"end": 6, "length": 7, "start": -2}

Message:

[Killed] ArithmeticOperator
src/analyzers/centerExpansion.js:17:10
 
   return {
     start: left + 1,
-    end: right - 1,
+    end: right + 1,
     length: right - left - 1
   };
killedBy: centerExpansion корректно расширяет палиндром вокруг нечетного центра
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0}
Received:
  {"end": 8, "length": 7, "start": 0}

Message:

[Killed] ArithmeticOperator
src/analyzers/centerExpansion.js:18:13
   return {
     start: left + 1,
     end: right - 1,
-    length: right - left - 1
+    length: right + left - 1
   };
 }
killedBy: centerExpansion корректно расширяет палиндром вокруг нечетного центра
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0}
Received:
  {"end": 6, "length": 5, "start": 0}

Message:

[Killed] ArithmeticOperator
src/analyzers/centerExpansion.js:18:13
   return {
     start: left + 1,
     end: right - 1,
-    length: right - left - 1
+    length: right - left + 1
   };
 }
killedBy: centerExpansion корректно расширяет палиндром вокруг нечетного центра
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0}
Received:
  {"end": 6, "length": 9, "start": 0}

Message:

[Killed] BlockStatement
src/analyzers/centerExpansion.js:22:33
   };
 }
 
-function centerExpansion(input) {
-  validateInput(input);
-
-  let best = { start: 0, end: 0, length: 1, value: input[0] };
-
-  // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
-  for (let i = 0; i < input.length; i += 1) {
-    const odd = expandAroundCenter(input, i, i);
-    // Stryker disable next-line ArithmeticOperator: expanding from (i, i+1) and (i, i-1) is equivalent for an even center.
-    const even = expandAroundCenter(input, i, i + 1);
-    // Stryker disable next-line EqualityOperator: odd and even palindrome lengths cannot be equal because of parity.
-    const candidate = odd.length >= even.length ? odd : even;
-
-    if (candidate.length > best.length) {
-      best = {
-        ...candidate,
-        value: input.slice(candidate.start, candidate.end + 1)
-      };
-    }
-  }
-
-  return best;
-}
+function centerExpansion(input) {}
 
 module.exports = { centerExpansion, expandAroundCenter };
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/analyzers/centerExpansion.js:25:14
 function centerExpansion(input) {
   validateInput(input);
 
-  let best = { start: 0, end: 0, length: 1, value: input[0] };
+  let best = {};
 
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  {}

Message:

[Killed] BlockStatement
src/analyzers/centerExpansion.js:28:45
   let best = { start: 0, end: 0, length: 1, value: input[0] };
 
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
-  for (let i = 0; i < input.length; i += 1) {
-    const odd = expandAroundCenter(input, i, i);
-    // Stryker disable next-line ArithmeticOperator: expanding from (i, i+1) and (i, i-1) is equivalent for an even center.
-    const even = expandAroundCenter(input, i, i + 1);
-    // Stryker disable next-line EqualityOperator: odd and even palindrome lengths cannot be equal because of parity.
-    const candidate = odd.length >= even.length ? odd : even;
-
-    if (candidate.length > best.length) {
-      best = {
-        ...candidate,
-        value: input.slice(candidate.start, candidate.end + 1)
-      };
-    }
-  }
+  for (let i = 0; i < input.length; i += 1) {}
 
   return best;
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  {"end": 0, "length": 1, "start": 0, "value": "a"}

Message:

[Killed] ConditionalExpression
src/analyzers/centerExpansion.js:28:19
   let best = { start: 0, end: 0, length: 1, value: input[0] };
 
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
-  for (let i = 0; i < input.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const odd = expandAroundCenter(input, i, i);
     // Stryker disable next-line ArithmeticOperator: expanding from (i, i+1) and (i, i-1) is equivalent for an even center.
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  {"end": 0, "length": 1, "start": 0, "value": "a"}

Message:

[Killed] ConditionalExpression
src/analyzers/centerExpansion.js:33:23
     // Stryker disable next-line ArithmeticOperator: expanding from (i, i+1) and (i, i-1) is equivalent for an even center.
     const even = expandAroundCenter(input, i, i + 1);
     // Stryker disable next-line EqualityOperator: odd and even palindrome lengths cannot be equal because of parity.
-    const candidate = odd.length >= even.length ? odd : even;
+    const candidate = true ? odd : even;
 
     if (candidate.length > best.length) {
killedBy: centerExpansion находит наибольший палиндром для четной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 3, "length": 4, "start": 0, "value": "abba"}
Received:
  {"end": 0, "length": 1, "start": 0, "value": "a"}

Message:

[Killed] ConditionalExpression
src/analyzers/centerExpansion.js:33:23
     // Stryker disable next-line ArithmeticOperator: expanding from (i, i+1) and (i, i-1) is equivalent for an even center.
     const even = expandAroundCenter(input, i, i + 1);
     // Stryker disable next-line EqualityOperator: odd and even palindrome lengths cannot be equal because of parity.
-    const candidate = odd.length >= even.length ? odd : even;
+    const candidate = false ? odd : even;
 
     if (candidate.length > best.length) {
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  {"end": 0, "length": 1, "start": 0, "value": "a"}

Message:

[Killed] BlockStatement
src/analyzers/centerExpansion.js:35:41
     // Stryker disable next-line EqualityOperator: odd and even palindrome lengths cannot be equal because of parity.
     const candidate = odd.length >= even.length ? odd : even;
 
-    if (candidate.length > best.length) {
-      best = {
-        ...candidate,
-        value: input.slice(candidate.start, candidate.end + 1)
-      };
-    }
+    if (candidate.length > best.length) {}
   }
 
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  {"end": 0, "length": 1, "start": 0, "value": "a"}

Message:

[Killed] EqualityOperator
src/analyzers/centerExpansion.js:35:9
     // Stryker disable next-line EqualityOperator: odd and even palindrome lengths cannot be equal because of parity.
     const candidate = odd.length >= even.length ? odd : even;
 
-    if (candidate.length > best.length) {
+    if (candidate.length <= best.length) {
       best = {
         ...candidate,
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  {"end": 6, "length": 1, "start": 6, "value": "a"}

Message:

[Killed] MethodExpression
src/analyzers/centerExpansion.js:38:16
     if (candidate.length > best.length) {
       best = {
         ...candidate,
-        value: input.slice(candidate.start, candidate.end + 1)
+        value: input
       };
     }
killedBy: centerExpansion возвращает именно наибольшую подстроку, а не всю строку
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 4, "length": 4, "start": 1, "value": "abba"}
Received:
  {"end": 4, "length": 4, "start": 1, "value": "cabbaq"}

Message:

[Killed] ArithmeticOperator
src/analyzers/centerExpansion.js:38:45
     if (candidate.length > best.length) {
       best = {
         ...candidate,
-        value: input.slice(candidate.start, candidate.end + 1)
+        value: input.slice(candidate.start, candidate.end - 1)
       };
     }
killedBy: centerExpansion находит наибольший палиндром для нечетной строки
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 6, "length": 7, "start": 0, "value": "abacaba"}
Received:
  {"end": 6, "length": 7, "start": 0, "value": "abaca"}

Message:
