[Killed] UnaryOperator
src/analyzers/manacherEven.js:10:15
   // Stryker disable next-line ArrayDeclaration: JS arrays grow dynamically, so preallocation is observably equivalent.
   const even = new Array(n).fill(0);
   let left = 0;
-  let right = -1;
+  let right = +1;
 
   for (let i = 0; i < n; i += 1) {
killedBy: manacherEven корректно вычисляет четные радиусы для a
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   NaN,

[Killed] EqualityOperator
src/analyzers/manacherEven.js:12:19
   let left = 0;
   let right = -1;
 
-  for (let i = 0; i < n; i += 1) {
+  for (let i = 0; i <= n; i += 1) {
     let radius = 0;
 
killedBy: manacherEven корректно вычисляет четные радиусы для a
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    0,
+   0,

[Killed] EqualityOperator
src/analyzers/manacherEven.js:12:19
   let left = 0;
   let right = -1;
 
-  for (let i = 0; i < n; i += 1) {
+  for (let i = 0; i >= n; i += 1) {
     let radius = 0;
 
killedBy: manacherEven корректно вычисляет четные радиусы для aa
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
-   1,
