[Killed] BlockStatement
src/analyzers/manacherOdd.js:1:31
-function validateInput(input) {
-  if (typeof input !== "string" || input.length === 0) {
-    throw new Error("Входная строка должна быть непустой");
-  }
-}
+function validateInput(input) {}
 
 function manacherOdd(input) {
killedBy: manacherEven выбрасывает ошибку для пустой строки
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Входная строка должна быть непустой"

Received function did not throw

[Killed] ConditionalExpression
src/analyzers/manacherOdd.js:2:36
 function validateInput(input) {
-  if (typeof input !== "string" || input.length === 0) {
+  if (typeof input !== "string" || false) {
     throw new Error("Входная строка должна быть непустой");
   }
killedBy: manacherEven выбрасывает ошибку для пустой строки
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Входная строка должна быть непустой"

Received function did not throw

[Killed] ConditionalExpression
src/analyzers/manacherOdd.js:2:7
 function validateInput(input) {
-  if (typeof input !== "string" || input.length === 0) {
+  if (false) {
     throw new Error("Входная строка должна быть непустой");
   }
killedBy: manacherEven выбрасывает ошибку для пустой строки
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Входная строка должна быть непустой"

Received function did not throw

[Killed] ConditionalExpression
src/analyzers/manacherOdd.js:16:19
   let left = 0;
   let right = -1;
 
-  for (let i = 0; i < n; i += 1) {
+  for (let i = 0; false; i += 1) {
     let radius = 1;
 
killedBy: manacherOdd корректно вычисляет нечетные радиусы для a
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   0,
