[Killed] Regex
src/io/jsonReader.js:3:29
 const fs = require("fs");
 
-const INPUT_FIELD_PATTERN = /"input"\s*:\s*"((?:\\.|[^"\\])*)"/s;
+const INPUT_FIELD_PATTERN = /"input"\s:\s*"((?:\\.|[^"\\])*)"/s;
 
 function trimBuffer(buffer) {
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [Error: JSON должен содержать непустое поле input]

[Killed] Regex
src/io/jsonReader.js:3:29
 const fs = require("fs");
 
-const INPUT_FIELD_PATTERN = /"input"\s*:\s*"((?:\\.|[^"\\])*)"/s;
+const INPUT_FIELD_PATTERN = /"input"\s*:\S*"((?:\\.|[^"\\])*)"/s;
 
 function trimBuffer(buffer) {
killedBy: jsonReader использует stub для имитации потоковой загрузки файла
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [Error: JSON должен содержать непустое поле input]

[Killed] BlockStatement
src/io/jsonReader.js:5:29
 
 const INPUT_FIELD_PATTERN = /"input"\s*:\s*"((?:\\.|[^"\\])*)"/s;
 
-function trimBuffer(buffer) {
-  const keyIndex = buffer.indexOf('"input"');
-
-  // Stryker disable next-line EqualityOperator: returning slice(0) and the original string is observably equivalent.
-  if (keyIndex >= 0) {
-    return buffer.slice(keyIndex);
-  }
-
-  // Stryker disable next-line ConditionalExpression, EqualityOperator: for strings slice(-4096) is equivalent in the boundary cases.
-  return buffer.length > 4096 ? buffer.slice(-4096) : buffer;
-}
+function trimBuffer(buffer) {}
 
 function extractInput(buffer) {
killedBy: jsonReader обрезает буфер до позиции ключа input при наличии служебного префикса
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\"input\":\"abba\"}"
Received: undefined

[Killed] BlockStatement
src/io/jsonReader.js:9:22
   const keyIndex = buffer.indexOf('"input"');
 
   // Stryker disable next-line EqualityOperator: returning slice(0) and the original string is observably equivalent.
-  if (keyIndex >= 0) {
-    return buffer.slice(keyIndex);
-  }
+  if (keyIndex >= 0) {}
 
   // Stryker disable next-line ConditionalExpression, EqualityOperator: for strings slice(-4096) is equivalent in the boundary cases.
killedBy: jsonReader обрезает буфер до позиции ключа input при наличии служебного префикса
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\"input\":\"abba\"}"
Received: "service-prefix::{\"input\":\"abba\"}"

[Killed] ConditionalExpression
src/io/jsonReader.js:9:7
   const keyIndex = buffer.indexOf('"input"');
 
   // Stryker disable next-line EqualityOperator: returning slice(0) and the original string is observably equivalent.
-  if (keyIndex >= 0) {
+  if (true) {
     return buffer.slice(keyIndex);
   }
killedBy: jsonReader ограничивает размер рабочего буфера до хвоста потока
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4096
Received: 1

[Killed] MethodExpression
src/io/jsonReader.js:10:12
 
   // Stryker disable next-line EqualityOperator: returning slice(0) and the original string is observably equivalent.
   if (keyIndex >= 0) {
-    return buffer.slice(keyIndex);
+    return buffer;
   }
 
killedBy: jsonReader обрезает буфер до позиции ключа input при наличии служебного префикса
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\"input\":\"abba\"}"
Received: "service-prefix::{\"input\":\"abba\"}"

[Killed] UnaryOperator
src/io/jsonReader.js:14:46
   }
 
   // Stryker disable next-line ConditionalExpression, EqualityOperator: for strings slice(-4096) is equivalent in the boundary cases.
-  return buffer.length > 4096 ? buffer.slice(-4096) : buffer;
+  return buffer.length > 4096 ? buffer.slice(+4096) : buffer;
 }
 
killedBy: jsonReader ограничивает размер рабочего буфера до хвоста потока
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4096
Received: 904

[Killed] MethodExpression
src/io/jsonReader.js:14:33
   }
 
   // Stryker disable next-line ConditionalExpression, EqualityOperator: for strings slice(-4096) is equivalent in the boundary cases.
-  return buffer.length > 4096 ? buffer.slice(-4096) : buffer;
+  return buffer.length > 4096 ? buffer : buffer;
 }
 
killedBy: jsonReader ограничивает размер рабочего буфера до хвоста потока
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4096
Received: 5000

[Killed] BlockStatement
src/io/jsonReader.js:17:31
   return buffer.length > 4096 ? buffer.slice(-4096) : buffer;
 }
 
-function extractInput(buffer) {
-  const match = buffer.match(INPUT_FIELD_PATTERN);
-
-  if (!match) {
-    return null;
-  }
-
-  const value = JSON.parse(`"${match[1]}"`);
-
-  // Stryker disable next-line ConditionalExpression: JSON.parse of the captured group always returns a string here.
-  if (typeof value !== "string" || value.length === 0) {
-    throw new Error("JSON должен содержать непустое поле input");
-  }
-
-  return value;
-}
+function extractInput(buffer) {}
 
 async function loadInputFromJson(path) {
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "level"
Received: undefined

[Killed] ConditionalExpression
src/io/jsonReader.js:20:7
 function extractInput(buffer) {
   const match = buffer.match(INPUT_FIELD_PATTERN);
 
-  if (!match) {
+  if (false) {
     return null;
   }
killedBy: jsonReader выбрасывает ошибку при отсутствии поля input
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "JSON должен содержать непустое поле input"
Received message:   "Cannot read properties of null (reading '1')"

      83 |       }
      84 |     }
    > 85 |     const value = JSON.parse(stryMutAct_9fa48("176") ? `` : (stryCov_9fa48("176"), `"${match[1]}"`));

[Killed] EqualityOperator
src/io/jsonReader.js:27:7
   const value = JSON.parse(`"${match[1]}"`);
 
   // Stryker disable next-line ConditionalExpression: JSON.parse of the captured group always returns a string here.
-  if (typeof value !== "string" || value.length === 0) {
+  if (typeof value === "string" || value.length === 0) {
     throw new Error("JSON должен содержать непустое поле input");
   }
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [Error: JSON должен содержать непустое поле input]

[Killed] BlockStatement
src/io/jsonReader.js:27:56
   const value = JSON.parse(`"${match[1]}"`);
 
   // Stryker disable next-line ConditionalExpression: JSON.parse of the captured group always returns a string here.
-  if (typeof value !== "string" || value.length === 0) {
-    throw new Error("JSON должен содержать непустое поле input");
-  }
+  if (typeof value !== "string" || value.length === 0) {}
 
   return value;
killedBy: jsonReader выбрасывает ошибку при пустом поле input
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: ""

[Killed] StringLiteral
src/io/jsonReader.js:28:21
 
   // Stryker disable next-line ConditionalExpression: JSON.parse of the captured group always returns a string here.
   if (typeof value !== "string" || value.length === 0) {
-    throw new Error("JSON должен содержать непустое поле input");
+    throw new Error("");
   }
 
killedBy: jsonReader выбрасывает ошибку при пустом поле input
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "JSON должен содержать непустое поле input"
Received message:   ""

      91 |       } else {
      92 |         stryCov_9fa48("185");
    > 93 |         throw new Error(stryMutAct_9fa48("186") ? "" : (stryCov_9fa48("186"), "JSON должен содержать непустое поле input"));

[Killed] BlockStatement
src/io/jsonReader.js:35:7
 }
 
 async function loadInputFromJson(path) {
-  try {
-    await fs.promises.access(path, fs.constants.F_OK);
-  } catch (error) {
+  try {} catch (error) {
     throw new Error("Файл не найден");
   }
killedBy: jsonReader выбрасывает ошибку, если файл не найден
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Файл не найден"
Received message:   "ENOENT: no such file or directory, open 'C:\\test\\mtpo-lab1\\palindrome_app\\.stryker-tmp\\sandbox-T6I0u3\\missing-file.json'"

[Killed] BlockStatement
src/io/jsonReader.js:37:19
 async function loadInputFromJson(path) {
   try {
     await fs.promises.access(path, fs.constants.F_OK);
-  } catch (error) {
-    throw new Error("Файл не найден");
-  }
+  } catch (error) {}
 
   // Stryker disable next-line StringLiteral: the parser searches the whole buffer, so the initial prefix is equivalent.
killedBy: jsonReader выбрасывает ошибку, если файл не найден
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Файл не найден"
Received message:   "ENOENT: no such file or directory, open 'C:\\test\\mtpo-lab1\\palindrome_app\\.stryker-tmp\\sandbox-T6I0u3\\missing-file.json'"

[Killed] BlockStatement
src/io/jsonReader.js:46:37
   // Stryker disable next-line ObjectLiteral, StringLiteral: UTF-8 is the default textual interpretation for our JSON inputs.
   const stream = fs.createReadStream(path, { encoding: "utf8" });
 
-  for await (const chunk of stream) {
-    buffer += chunk;
-    const input = extractInput(buffer);
-
-    if (input !== null) {
-      stream.destroy();
-      return input;
-    }
-
-    buffer = trimBuffer(buffer);
-  }
+  for await (const chunk of stream) {}
 
   throw new Error("JSON должен содержать непустое поле input");
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [Error: JSON должен содержать непустое поле input]

[Killed] AssignmentOperator
src/io/jsonReader.js:47:5
   const stream = fs.createReadStream(path, { encoding: "utf8" });
 
   for await (const chunk of stream) {
-    buffer += chunk;
+    buffer -= chunk;
     const input = extractInput(buffer);
 
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [TypeError: buffer.match is not a function]

[Killed] EqualityOperator
src/io/jsonReader.js:50:9
     buffer += chunk;
     const input = extractInput(buffer);
 
-    if (input !== null) {
+    if (input === null) {
       stream.destroy();
       return input;
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [Error: JSON должен содержать непустое поле input]

[Killed] ConditionalExpression
src/io/jsonReader.js:50:9
     buffer += chunk;
     const input = extractInput(buffer);
 
-    if (input !== null) {
+    if (false) {
       stream.destroy();
       return input;
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [Error: JSON должен содержать непустое поле input]

[Killed] ObjectLiteral
src/io/jsonReader.js:61:18
   throw new Error("JSON должен содержать непустое поле input");
 }
 
-module.exports = { loadInputFromJson, extractInput, trimBuffer };
+module.exports = {};
 
killedBy: jsonReader корректно читает входную строку из JSON
statusReason: TypeError: loadInputFromJson is not a function
