[Killed] BlockStatement
src/services/palindromeService.js:5:22
 const { manacherEven } = require("../analyzers/manacherEven");
 const { centerExpansion, expandAroundCenter } = require("../analyzers/centerExpansion");
 
-function sum(values) {
-  return values.reduce((accumulator, value) => accumulator + value, 0);
-}
+function sum(values) {}
 
 function buildRecommendation(input, longestPalindrome) {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] ArithmeticOperator
src/services/palindromeService.js:6:48
 const { centerExpansion, expandAroundCenter } = require("../analyzers/centerExpansion");
 
 function sum(values) {
-  return values.reduce((accumulator, value) => accumulator + value, 0);
+  return values.reduce((accumulator, value) => accumulator - value, 0);
 }
 
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  12
Received:
  -12

Message:

[Killed] ArrowFunction
src/services/palindromeService.js:6:24
 const { centerExpansion, expandAroundCenter } = require("../analyzers/centerExpansion");
 
 function sum(values) {
-  return values.reduce((accumulator, value) => accumulator + value, 0);
+  return values.reduce(() => undefined, 0);
 }
 
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] BlockStatement
src/services/palindromeService.js:9:56
   return values.reduce((accumulator, value) => accumulator + value, 0);
 }
 
-function buildRecommendation(input, longestPalindrome) {
-  if (longestPalindrome.length === input.length) {
-    return "Строка целиком является палиндромом.";
-  }
-
-  if (longestPalindrome.length >= Math.ceil(input.length * 0.6)) {
-    return "Строка содержит крупный палиндромный фрагмент.";
-  }
-
-  if (longestPalindrome.length <= 2) {
-    return "В строке преобладают только короткие палиндромы.";
-  }
-
-  return "Строка содержит несколько локальных палиндромных областей.";
-}
+function buildRecommendation(input, longestPalindrome) {}
 
 function findLongestPalindrome(input, odd, even) {
killedBy: palindromeService формирует рекомендацию о полной симметрии
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Строка целиком является палиндромом."
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/palindromeService.js:10:50
 }
 
 function buildRecommendation(input, longestPalindrome) {
-  if (longestPalindrome.length === input.length) {
-    return "Строка целиком является палиндромом.";
-  }
+  if (longestPalindrome.length === input.length) {}
 
   if (longestPalindrome.length >= Math.ceil(input.length * 0.6)) {
killedBy: palindromeService формирует рекомендацию о полной симметрии
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Строка целиком является палиндромом."
Received:
  "Строка содержит крупный палиндромный фрагмент."

Message:

[Killed] ConditionalExpression
src/services/palindromeService.js:10:7
 }
 
 function buildRecommendation(input, longestPalindrome) {
-  if (longestPalindrome.length === input.length) {
+  if (true) {
     return "Строка целиком является палиндромом.";
   }
killedBy: palindromeService формирует рекомендацию о крупном палиндромном фрагменте
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Строка содержит крупный палиндромный фрагмент."
Received:
  "Строка целиком является палиндромом."

Message:

[Killed] ArithmeticOperator
src/services/palindromeService.js:14:45
     return "Строка целиком является палиндромом.";
   }
 
-  if (longestPalindrome.length >= Math.ceil(input.length * 0.6)) {
+  if (longestPalindrome.length >= Math.ceil(input.length / 0.6)) {
     return "Строка содержит крупный палиндромный фрагмент.";
   }
killedBy: palindromeService формирует рекомендацию о крупном палиндромном фрагменте
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Строка содержит крупный палиндромный фрагмент."
Received:
  "Строка содержит несколько локальных палиндромных областей."

Message:

[Killed] BlockStatement
src/services/palindromeService.js:14:66
     return "Строка целиком является палиндромом.";
   }
 
-  if (longestPalindrome.length >= Math.ceil(input.length * 0.6)) {
-    return "Строка содержит крупный палиндромный фрагмент.";
-  }
+  if (longestPalindrome.length >= Math.ceil(input.length * 0.6)) {}
 
   if (longestPalindrome.length <= 2) {
killedBy: palindromeService формирует рекомендацию о крупном палиндромном фрагменте
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Строка содержит крупный палиндромный фрагмент."
Received:
  "Строка содержит несколько локальных палиндромных областей."

Message:

[Killed] StringLiteral
src/services/palindromeService.js:15:12
   }
 
   if (longestPalindrome.length >= Math.ceil(input.length * 0.6)) {
-    return "Строка содержит крупный палиндромный фрагмент.";
+    return "";
   }
 
killedBy: palindromeService формирует рекомендацию о крупном палиндромном фрагменте
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Строка содержит крупный палиндромный фрагмент."
Received:
  ""

Message:

[Killed] EqualityOperator
src/services/palindromeService.js:18:7
     return "Строка содержит крупный палиндромный фрагмент.";
   }
 
-  if (longestPalindrome.length <= 2) {
+  if (longestPalindrome.length > 2) {
     return "В строке преобладают только короткие палиндромы.";
   }
killedBy: palindromeService формирует рекомендацию о коротких палиндромах
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "В строке преобладают только короткие палиндромы."
Received:
  "Строка содержит несколько локальных палиндромных областей."

Message:

[Killed] EqualityOperator
src/services/palindromeService.js:18:7
     return "Строка содержит крупный палиндромный фрагмент.";
   }
 
-  if (longestPalindrome.length <= 2) {
+  if (longestPalindrome.length < 2) {
     return "В строке преобладают только короткие палиндромы.";
   }
killedBy: palindromeService относит палиндром длины 2 к коротким палиндромам
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "В строке преобладают только короткие палиндромы."
Received:
  "Строка содержит несколько локальных палиндромных областей."

Message:

[Killed] StringLiteral
src/services/palindromeService.js:19:12
   }
 
   if (longestPalindrome.length <= 2) {
-    return "В строке преобладают только короткие палиндромы.";
+    return "";
   }
 
killedBy: palindromeService формирует рекомендацию о коротких палиндромах
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "В строке преобладают только короткие палиндромы."
Received:
  ""

Message:

[Killed] StringLiteral
src/services/palindromeService.js:22:10
     return "В строке преобладают только короткие палиндромы.";
   }
 
-  return "Строка содержит несколько локальных палиндромных областей.";
+  return "";
 }
 
killedBy: palindromeService формирует рекомендацию о локальных палиндромных областях
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Строка содержит несколько локальных палиндромных областей."
Received:
  ""

Message:

[Killed] BlockStatement
src/services/palindromeService.js:25:50
   return "Строка содержит несколько локальных палиндромных областей.";
 }
 
-function findLongestPalindrome(input, odd, even) {
-  let best = { start: 0, end: 0, length: 1, value: input[0] };
-
-  // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
-  for (let i = 0; i < input.length; i += 1) {
-    const oddLength = odd[i] * 2 - 1;
-    if (oddLength > best.length) {
-      const start = i - odd[i] + 1;
-      const end = i + odd[i] - 1;
-      best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
-    }
-
-    const evenLength = even[i] * 2;
-    if (evenLength > best.length) {
-      const start = i - even[i];
-      const end = i + even[i] - 1;
-      best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
-    }
-  }
-
-  return best;
-}
+function findLongestPalindrome(input, odd, even) {}
 
 function buildAnalysisResult(input, oddRadii, evenRadii, algorithm) {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/services/palindromeService.js:29:45
   let best = { start: 0, end: 0, length: 1, value: input[0] };
 
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
-  for (let i = 0; i < input.length; i += 1) {
-    const oddLength = odd[i] * 2 - 1;
-    if (oddLength > best.length) {
-      const start = i - odd[i] + 1;
-      const end = i + odd[i] - 1;
-      best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
-    }
-
-    const evenLength = even[i] * 2;
-    if (evenLength > best.length) {
-      const start = i - even[i];
-      const end = i + even[i] - 1;
-      best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
-    }
-  }
+  for (let i = 0; i < input.length; i += 1) {}
 
   return best;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:30:23
 
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
   for (let i = 0; i < input.length; i += 1) {
-    const oddLength = odd[i] * 2 - 1;
+    const oddLength = odd[i] / 2 - 1;
     if (oddLength > best.length) {
       const start = i - odd[i] + 1;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:30:23
 
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
   for (let i = 0; i < input.length; i += 1) {
-    const oddLength = odd[i] * 2 - 1;
+    const oddLength = odd[i] * 2 + 1;
     if (oddLength > best.length) {
       const start = i - odd[i] + 1;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ConditionalExpression
src/services/palindromeService.js:31:9
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
   for (let i = 0; i < input.length; i += 1) {
     const oddLength = odd[i] * 2 - 1;
-    if (oddLength > best.length) {
+    if (true) {
       const start = i - odd[i] + 1;
       const end = i + odd[i] - 1;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] BlockStatement
src/services/palindromeService.js:31:34
   // Stryker disable next-line EqualityOperator: the extra terminal iteration cannot improve the best palindrome.
   for (let i = 0; i < input.length; i += 1) {
     const oddLength = odd[i] * 2 - 1;
-    if (oddLength > best.length) {
-      const start = i - odd[i] + 1;
-      const end = i + odd[i] - 1;
-      best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
-    }
+    if (oddLength > best.length) {}
 
     const evenLength = even[i] * 2;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:32:21
   for (let i = 0; i < input.length; i += 1) {
     const oddLength = odd[i] * 2 - 1;
     if (oddLength > best.length) {
-      const start = i - odd[i] + 1;
+      const start = i + odd[i] + 1;
       const end = i + odd[i] - 1;
       best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:32:21
   for (let i = 0; i < input.length; i += 1) {
     const oddLength = odd[i] * 2 - 1;
     if (oddLength > best.length) {
-      const start = i - odd[i] + 1;
+      const start = i - odd[i] - 1;
       const end = i + odd[i] - 1;
       best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:33:19
     const oddLength = odd[i] * 2 - 1;
     if (oddLength > best.length) {
       const start = i - odd[i] + 1;
-      const end = i + odd[i] - 1;
+      const end = i + odd[i] + 1;
       best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
     }
killedBy: palindromeService совпадает с независимым oracle на полном наборе коротких строк
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"end": 2, "length": 3, "start": 0, "value": "aaa"}
Received:
  {"end": 4, "length": 3, "start": 0, "value": "aaa"}

Message:

[Killed] ArithmeticOperator
src/services/palindromeService.js:33:19
     const oddLength = odd[i] * 2 - 1;
     if (oddLength > best.length) {
       const start = i - odd[i] + 1;
-      const end = i + odd[i] - 1;
+      const end = i - odd[i] - 1;
       best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
     }
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:34:73
     if (oddLength > best.length) {
       const start = i - odd[i] + 1;
       const end = i + odd[i] - 1;
-      best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
+      best = { start, end, length: oddLength, value: input.slice(start, end - 1) };
     }
 
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] MethodExpression
src/services/palindromeService.js:34:54
     if (oddLength > best.length) {
       const start = i - odd[i] + 1;
       const end = i + odd[i] - 1;
-      best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
+      best = { start, end, length: oddLength, value: input };
     }
 
killedBy: palindromeService совпадает с независимым oracle на полном наборе коротких строк
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:37:24
       best = { start, end, length: oddLength, value: input.slice(start, end + 1) };
     }
 
-    const evenLength = even[i] * 2;
+    const evenLength = even[i] / 2;
     if (evenLength > best.length) {
       const start = i - even[i];
killedBy: palindromeService находит наибольший четный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ConditionalExpression
src/services/palindromeService.js:38:9
     }
 
     const evenLength = even[i] * 2;
-    if (evenLength > best.length) {
+    if (true) {
       const start = i - even[i];
       const end = i + even[i] - 1;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] BlockStatement
src/services/palindromeService.js:38:35
     }
 
     const evenLength = even[i] * 2;
-    if (evenLength > best.length) {
-      const start = i - even[i];
-      const end = i + even[i] - 1;
-      best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
-    }
+    if (evenLength > best.length) {}
   }
 
killedBy: palindromeService находит наибольший четный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:39:21
 
     const evenLength = even[i] * 2;
     if (evenLength > best.length) {
-      const start = i - even[i];
+      const start = i + even[i];
       const end = i + even[i] - 1;
       best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
killedBy: palindromeService находит наибольший четный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:40:19
     const evenLength = even[i] * 2;
     if (evenLength > best.length) {
       const start = i - even[i];
-      const end = i + even[i] - 1;
+      const end = i + even[i] + 1;
       best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
     }
killedBy: palindromeService возвращает служебные поля сравнения и подстроку для неполного палиндрома
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:40:19
     const evenLength = even[i] * 2;
     if (evenLength > best.length) {
       const start = i - even[i];
-      const end = i + even[i] - 1;
+      const end = i - even[i] - 1;
       best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
     }
killedBy: palindromeService находит наибольший четный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:41:74
     if (evenLength > best.length) {
       const start = i - even[i];
       const end = i + even[i] - 1;
-      best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
+      best = { start, end, length: evenLength, value: input.slice(start, end - 1) };
     }
   }
killedBy: palindromeService находит наибольший четный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] MethodExpression
src/services/palindromeService.js:41:55
     if (evenLength > best.length) {
       const start = i - even[i];
       const end = i + even[i] - 1;
-      best = { start, end, length: evenLength, value: input.slice(start, end + 1) };
+      best = { start, end, length: evenLength, value: input };
     }
   }
killedBy: palindromeService возвращает служебные поля сравнения и подстроку для неполного палиндрома
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] BlockStatement
src/services/palindromeService.js:48:69
   return best;
 }
 
-function buildAnalysisResult(input, oddRadii, evenRadii, algorithm) {
-  const longestPalindrome = findLongestPalindrome(input, oddRadii, evenRadii);
-
-  return {
-    algorithm,
-    input,
-    oddRadii,
-    evenRadii,
-    longestPalindrome,
-    palindromeCount: sum(oddRadii) + sum(evenRadii),
-    recommendation: buildRecommendation(input, longestPalindrome)
-  };
-}
+function buildAnalysisResult(input, oddRadii, evenRadii, algorithm) {}
 
 function collectCenterExpansionRadii(input) {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: Cannot read properties of undefined (reading 'longestPalindrome')

[Killed] ObjectLiteral
src/services/palindromeService.js:51:10
 function buildAnalysisResult(input, oddRadii, evenRadii, algorithm) {
   const longestPalindrome = findLongestPalindrome(input, oddRadii, evenRadii);
 
-  return {
-    algorithm,
-    input,
-    oddRadii,
-    evenRadii,
-    longestPalindrome,
-    palindromeCount: sum(oddRadii) + sum(evenRadii),
-    recommendation: buildRecommendation(input, longestPalindrome)
-  };
+  return {};
 }
 
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] ArithmeticOperator
src/services/palindromeService.js:57:22
     oddRadii,
     evenRadii,
     longestPalindrome,
-    palindromeCount: sum(oddRadii) + sum(evenRadii),
+    palindromeCount: sum(oddRadii) - sum(evenRadii),
     recommendation: buildRecommendation(input, longestPalindrome)
   };
killedBy: palindromeService формирует сопоставимый отчет для расширения от центра
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  6
Received:
  2

Message:

[Killed] BlockStatement
src/services/palindromeService.js:62:45
   };
 }
 
-function collectCenterExpansionRadii(input) {
-  const oddRadii = [];
-  const evenRadii = [];
-
-  for (let i = 0; i < input.length; i += 1) {
-    const odd = expandAroundCenter(input, i, i);
-    const even = expandAroundCenter(input, i - 1, i);
-
-    oddRadii.push((odd.length + 1) / 2);
-    evenRadii.push(even.length / 2);
-  }
-
-  return { oddRadii, evenRadii };
-}
+function collectCenterExpansionRadii(input) {}
 
 function analyzeWithCenterExpansion(input, collaborators = {}) {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: Cannot destructure property 'oddRadii' of 'radiiCollector(...)' as it is undefined.

[Killed] ArrayDeclaration
src/services/palindromeService.js:64:21
 
 function collectCenterExpansionRadii(input) {
   const oddRadii = [];
-  const evenRadii = [];
+  const evenRadii = ["Stryker was here"];
 
   for (let i = 0; i < input.length; i += 1) {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] ConditionalExpression
src/services/palindromeService.js:66:19
   const oddRadii = [];
   const evenRadii = [];
 
-  for (let i = 0; i < input.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const odd = expandAroundCenter(input, i, i);
     const even = expandAroundCenter(input, i - 1, i);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] EqualityOperator
src/services/palindromeService.js:66:19
   const oddRadii = [];
   const evenRadii = [];
 
-  for (let i = 0; i < input.length; i += 1) {
+  for (let i = 0; i >= input.length; i += 1) {
     const odd = expandAroundCenter(input, i, i);
     const even = expandAroundCenter(input, i - 1, i);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:68:44
 
   for (let i = 0; i < input.length; i += 1) {
     const odd = expandAroundCenter(input, i, i);
-    const even = expandAroundCenter(input, i - 1, i);
+    const even = expandAroundCenter(input, i + 1, i);
 
     oddRadii.push((odd.length + 1) / 2);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] ArithmeticOperator
src/services/palindromeService.js:70:20
     const odd = expandAroundCenter(input, i, i);
     const even = expandAroundCenter(input, i - 1, i);
 
-    oddRadii.push((odd.length + 1) / 2);
+    oddRadii.push((odd.length - 1) / 2);
     evenRadii.push(even.length / 2);
   }
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:70:19
     const odd = expandAroundCenter(input, i, i);
     const even = expandAroundCenter(input, i - 1, i);
 
-    oddRadii.push((odd.length + 1) / 2);
+    oddRadii.push((odd.length + 1) * 2);
     evenRadii.push(even.length / 2);
   }
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] ArithmeticOperator
src/services/palindromeService.js:71:20
     const even = expandAroundCenter(input, i - 1, i);
 
     oddRadii.push((odd.length + 1) / 2);
-    evenRadii.push(even.length / 2);
+    evenRadii.push(even.length * 2);
   }
 
killedBy: palindromeService находит наибольший четный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно

[Killed] BlockStatement
src/services/palindromeService.js:77:64
   return { oddRadii, evenRadii };
 }
 
-function analyzeWithCenterExpansion(input, collaborators = {}) {
-  const radiiCollector = collaborators.radiiCollector || collectCenterExpansionRadii;
-  const referenceExpansion = collaborators.referenceExpansion || centerExpansion;
-  const { oddRadii, evenRadii } = radiiCollector(input);
-  const result = buildAnalysisResult(input, oddRadii, evenRadii, "center-expansion");
-  const reference = referenceExpansion(input);
-
-  if (
-    reference.value !== result.longestPalindrome.value ||
-    reference.length !== result.longestPalindrome.length
-  ) {
-    throw new Error("Эталонный анализ расширением от центра сформирован некорректно");
-  }
-
-  return result;
-}
+function analyzeWithCenterExpansion(input, collaborators = {}) {}
 
 function analyzeString(input, collaborators = {}) {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: Cannot read properties of undefined (reading 'longestPalindrome')

[Killed] LogicalOperator
src/services/palindromeService.js:78:26
 }
 
 function analyzeWithCenterExpansion(input, collaborators = {}) {
-  const radiiCollector = collaborators.radiiCollector || collectCenterExpansionRadii;
+  const radiiCollector = collaborators.radiiCollector && collectCenterExpansionRadii;
   const referenceExpansion = collaborators.referenceExpansion || centerExpansion;
   const { oddRadii, evenRadii } = radiiCollector(input);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: radiiCollector is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:78:26
 }
 
 function analyzeWithCenterExpansion(input, collaborators = {}) {
-  const radiiCollector = collaborators.radiiCollector || collectCenterExpansionRadii;
+  const radiiCollector = true;
   const referenceExpansion = collaborators.referenceExpansion || centerExpansion;
   const { oddRadii, evenRadii } = radiiCollector(input);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: radiiCollector is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:79:30
 
 function analyzeWithCenterExpansion(input, collaborators = {}) {
   const radiiCollector = collaborators.radiiCollector || collectCenterExpansionRadii;
-  const referenceExpansion = collaborators.referenceExpansion || centerExpansion;
+  const referenceExpansion = false;
   const { oddRadii, evenRadii } = radiiCollector(input);
   const result = buildAnalysisResult(input, oddRadii, evenRadii, "center-expansion");
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: referenceExpansion is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:79:30
 
 function analyzeWithCenterExpansion(input, collaborators = {}) {
   const radiiCollector = collaborators.radiiCollector || collectCenterExpansionRadii;
-  const referenceExpansion = collaborators.referenceExpansion || centerExpansion;
+  const referenceExpansion = true;
   const { oddRadii, evenRadii } = radiiCollector(input);
   const result = buildAnalysisResult(input, oddRadii, evenRadii, "center-expansion");
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: referenceExpansion is not a function

[Killed] LogicalOperator
src/services/palindromeService.js:85:5
   const reference = referenceExpansion(input);
 
   if (
-    reference.value !== result.longestPalindrome.value ||
-    reference.length !== result.longestPalindrome.length
+    reference.value !== result.longestPalindrome.value && reference.length !== result.longestPalindrome.length
   ) {
     throw new Error("Эталонный анализ расширением от центра сформирован некорректно");
killedBy: palindromeService выбрасывает ошибку при рассогласовании эталонного алгоритма по значению
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  null
Received:
  undefined

Message:

[Killed] ConditionalExpression
src/services/palindromeService.js:85:5
   const reference = referenceExpansion(input);
 
   if (
-    reference.value !== result.longestPalindrome.value ||
+    false ||
     reference.length !== result.longestPalindrome.length
   ) {
killedBy: palindromeService выбрасывает ошибку при рассогласовании эталонного алгоритма по значению
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  null
Received:
  undefined

Message:

[Killed] EqualityOperator
src/services/palindromeService.js:86:5
 
   if (
     reference.value !== result.longestPalindrome.value ||
-    reference.length !== result.longestPalindrome.length
+    reference.length === result.longestPalindrome.length
   ) {
     throw new Error("Эталонный анализ расширением от центра сформирован некорректно");
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Эталонный анализ расширением от центра сформирован некорректно
