[Killed] ConditionalExpression
src/services/palindromeService.js:86:5
 
   if (
     reference.value !== result.longestPalindrome.value ||
-    reference.length !== result.longestPalindrome.length
+    false
   ) {
     throw new Error("Эталонный анализ расширением от центра сформирован некорректно");
killedBy: palindromeService выбрасывает ошибку при рассогласовании эталонного алгоритма по длине
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  null
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/palindromeService.js:87:5
   if (
     reference.value !== result.longestPalindrome.value ||
     reference.length !== result.longestPalindrome.length
-  ) {
-    throw new Error("Эталонный анализ расширением от центра сформирован некорректно");
-  }
+  ) {}
 
   return result;
killedBy: palindromeService выбрасывает ошибку при рассогласовании эталонного алгоритма по значению
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  null
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/palindromeService.js:94:51
   return result;
 }
 
-function analyzeString(input, collaborators = {}) {
-  const oddAnalyzer = collaborators.oddAnalyzer || manacherOdd;
-  const evenAnalyzer = collaborators.evenAnalyzer || manacherEven;
-  const referenceAnalyzer = collaborators.referenceAnalyzer || analyzeWithCenterExpansion;
-  const oddRadii = oddAnalyzer(input);
-  const evenRadii = evenAnalyzer(input);
-  const result = buildAnalysisResult(input, oddRadii, evenRadii, "manacher");
-  const reference = referenceAnalyzer(input);
-
-  if (
-    reference.longestPalindrome.value !== result.longestPalindrome.value ||
-    reference.longestPalindrome.length !== result.longestPalindrome.length ||
-    reference.palindromeCount !== result.palindromeCount
-  ) {
-    throw new Error("Результаты алгоритмов не совпадают");
-  }
-
-  return {
-    ...result,
-    comparison: {
-      referenceAlgorithm: "center-expansion",
-      matches: true
-    }
-  };
-}
+function analyzeString(input, collaborators = {}) {}
 
 module.exports = {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: Cannot read properties of undefined (reading 'longestPalindrome')

[Killed] ConditionalExpression
src/services/palindromeService.js:95:23
 }
 
 function analyzeString(input, collaborators = {}) {
-  const oddAnalyzer = collaborators.oddAnalyzer || manacherOdd;
+  const oddAnalyzer = false;
   const evenAnalyzer = collaborators.evenAnalyzer || manacherEven;
   const referenceAnalyzer = collaborators.referenceAnalyzer || analyzeWithCenterExpansion;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: oddAnalyzer is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:95:23
 }
 
 function analyzeString(input, collaborators = {}) {
-  const oddAnalyzer = collaborators.oddAnalyzer || manacherOdd;
+  const oddAnalyzer = true;
   const evenAnalyzer = collaborators.evenAnalyzer || manacherEven;
   const referenceAnalyzer = collaborators.referenceAnalyzer || analyzeWithCenterExpansion;
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: oddAnalyzer is not a function

[Killed] LogicalOperator
src/services/palindromeService.js:96:24
 
 function analyzeString(input, collaborators = {}) {
   const oddAnalyzer = collaborators.oddAnalyzer || manacherOdd;
-  const evenAnalyzer = collaborators.evenAnalyzer || manacherEven;
+  const evenAnalyzer = collaborators.evenAnalyzer && manacherEven;
   const referenceAnalyzer = collaborators.referenceAnalyzer || analyzeWithCenterExpansion;
   const oddRadii = oddAnalyzer(input);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: evenAnalyzer is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:96:24
 
 function analyzeString(input, collaborators = {}) {
   const oddAnalyzer = collaborators.oddAnalyzer || manacherOdd;
-  const evenAnalyzer = collaborators.evenAnalyzer || manacherEven;
+  const evenAnalyzer = false;
   const referenceAnalyzer = collaborators.referenceAnalyzer || analyzeWithCenterExpansion;
   const oddRadii = oddAnalyzer(input);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: evenAnalyzer is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:97:29
 function analyzeString(input, collaborators = {}) {
   const oddAnalyzer = collaborators.oddAnalyzer || manacherOdd;
   const evenAnalyzer = collaborators.evenAnalyzer || manacherEven;
-  const referenceAnalyzer = collaborators.referenceAnalyzer || analyzeWithCenterExpansion;
+  const referenceAnalyzer = true;
   const oddRadii = oddAnalyzer(input);
   const evenRadii = evenAnalyzer(input);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: referenceAnalyzer is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:97:29
 function analyzeString(input, collaborators = {}) {
   const oddAnalyzer = collaborators.oddAnalyzer || manacherOdd;
   const evenAnalyzer = collaborators.evenAnalyzer || manacherEven;
-  const referenceAnalyzer = collaborators.referenceAnalyzer || analyzeWithCenterExpansion;
+  const referenceAnalyzer = false;
   const oddRadii = oddAnalyzer(input);
   const evenRadii = evenAnalyzer(input);
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: TypeError: referenceAnalyzer is not a function

[Killed] ConditionalExpression
src/services/palindromeService.js:104:5
   const reference = referenceAnalyzer(input);
 
   if (
-    reference.longestPalindrome.value !== result.longestPalindrome.value ||
-    reference.longestPalindrome.length !== result.longestPalindrome.length ||
-    reference.palindromeCount !== result.palindromeCount
+    true
   ) {
     throw new Error("Результаты алгоритмов не совпадают");
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] EqualityOperator
src/services/palindromeService.js:104:5
   const reference = referenceAnalyzer(input);
 
   if (
-    reference.longestPalindrome.value !== result.longestPalindrome.value ||
+    reference.longestPalindrome.value === result.longestPalindrome.value ||
     reference.longestPalindrome.length !== result.longestPalindrome.length ||
     reference.palindromeCount !== result.palindromeCount
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] ConditionalExpression
src/services/palindromeService.js:105:5
 
   if (
     reference.longestPalindrome.value !== result.longestPalindrome.value ||
-    reference.longestPalindrome.length !== result.longestPalindrome.length ||
+    false ||
     reference.palindromeCount !== result.palindromeCount
   ) {
killedBy: palindromeService выбрасывает ошибку при рассогласовании алгоритмов по длине палиндрома
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  null
Received:
  undefined

Message:

[Killed] EqualityOperator
src/services/palindromeService.js:105:5
 
   if (
     reference.longestPalindrome.value !== result.longestPalindrome.value ||
-    reference.longestPalindrome.length !== result.longestPalindrome.length ||
+    reference.longestPalindrome.length === result.longestPalindrome.length ||
     reference.palindromeCount !== result.palindromeCount
   ) {
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] EqualityOperator
src/services/palindromeService.js:106:5
   if (
     reference.longestPalindrome.value !== result.longestPalindrome.value ||
     reference.longestPalindrome.length !== result.longestPalindrome.length ||
-    reference.palindromeCount !== result.palindromeCount
+    reference.palindromeCount === result.palindromeCount
   ) {
     throw new Error("Результаты алгоритмов не совпадают");
killedBy: palindromeService находит наибольший нечетный палиндром
statusReason: Error: Результаты алгоритмов не совпадают

[Killed] ConditionalExpression
src/services/palindromeService.js:106:5
   if (
     reference.longestPalindrome.value !== result.longestPalindrome.value ||
     reference.longestPalindrome.length !== result.longestPalindrome.length ||
-    reference.palindromeCount !== result.palindromeCount
+    false
   ) {
     throw new Error("Результаты алгоритмов не совпадают");
killedBy: palindromeService выбрасывает ошибку при рассогласовании алгоритмов по числу палиндромов
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  null
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/palindromeService.js:107:5
     reference.longestPalindrome.value !== result.longestPalindrome.value ||
     reference.longestPalindrome.length !== result.longestPalindrome.length ||
     reference.palindromeCount !== result.palindromeCount
-  ) {
-    throw new Error("Результаты алгоритмов не совпадают");
-  }
+  ) {}
 
   return {
killedBy: palindromeService выбрасывает ошибку при рассогласовании алгоритмов по значению палиндрома
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  null
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/palindromeService.js:113:17
 
   return {
     ...result,
-    comparison: {
-      referenceAlgorithm: "center-expansion",
-      matches: true
-    }
+    comparison: {}
   };
 }
killedBy: palindromeService возвращает служебные поля сравнения и подстроку для неполного палиндрома
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"matches": true, "referenceAlgorithm": "center-expansion"}
Received:
  {}

Message:

[Killed] BooleanLiteral
src/services/palindromeService.js:115:16
     ...result,
     comparison: {
       referenceAlgorithm: "center-expansion",
-      matches: true
+      matches: false
     }
   };
killedBy: palindromeService возвращает служебные поля сравнения и подстроку для неполного палиндрома
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"matches": true, "referenceAlgorithm": "center-expansion"}
Received:
  {"matches": false, "referenceAlgorithm": "center-expansion"}

Message:
