[Killed] BlockStatement
src/io/resultWriter.js:3:36
 const fs = require("fs");
 
-function formatResultLines(result) {
-  return [
-    `Исходная строка: ${result.input}`,
-    `Нечетные радиусы: [${result.oddRadii.join(", ")}]`,
-    `Четные радиусы: [${result.evenRadii.join(", ")}]`,
-    `Наибольший палиндром: ${result.longestPalindrome.value}`,
-    `Длина: ${result.longestPalindrome.length}`,
-    `Количество палиндромных подстрок: ${result.palindromeCount}`,
-    `Рекомендация: ${result.recommendation}`
-  ];
-}
+function formatResultLines(result) {}
 
 function printResult(result, logger = console.log) {
killedBy: resultWriter формирует человекочитаемые строки отчета
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]", "Четные радиусы: [0, 0, 2, 0]", "Наибольший палиндром: abba", "Длина: 4", "Количество палиндромных подстрок: 6", "Рекомендация: Строка содержит крупный палиндромный фрагмент."]
Received:
  undefined

Message:

[Killed] ArrayDeclaration
src/io/resultWriter.js:4:10
 const fs = require("fs");
 
 function formatResultLines(result) {
-  return [
-    `Исходная строка: ${result.input}`,
-    `Нечетные радиусы: [${result.oddRadii.join(", ")}]`,
-    `Четные радиусы: [${result.evenRadii.join(", ")}]`,
-    `Наибольший палиндром: ${result.longestPalindrome.value}`,
-    `Длина: ${result.longestPalindrome.length}`,
-    `Количество палиндромных подстрок: ${result.palindromeCount}`,
-    `Рекомендация: ${result.recommendation}`
-  ];
+  return [];
 }
 
killedBy: resultWriter формирует человекочитаемые строки отчета
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]", "Четные радиусы: [0, 0, 2, 0]", "Наибольший палиндром: abba", "Длина: 4", "Количество палиндромных подстрок: 6", "Рекомендация: Строка содержит крупный палиндромный фрагмент."]
Received:
  []

Message:

[Killed] StringLiteral
src/io/resultWriter.js:5:5
 
 function formatResultLines(result) {
   return [
-    `Исходная строка: ${result.input}`,
+    ``,
     `Нечетные радиусы: [${result.oddRadii.join(", ")}]`,
     `Четные радиусы: [${result.evenRadii.join(", ")}]`,
killedBy: resultWriter формирует человекочитаемые строки отчета
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]", "Четные радиусы: [0, 0, 2, 0]", "Наибольший палиндром: abba", "Длина: 4", "Количество палиндромных подстрок: 6", "Рекомендация: Строка содержит крупный палиндромный фрагмент."]
Received:
  ["", "Нечетные радиусы: [1, 1, 1, 1]", "Четные радиусы: [

[Killed] StringLiteral
src/io/resultWriter.js:9:5
     `Нечетные радиусы: [${result.oddRadii.join(", ")}]`,
     `Четные радиусы: [${result.evenRadii.join(", ")}]`,
     `Наибольший палиндром: ${result.longestPalindrome.value}`,
-    `Длина: ${result.longestPalindrome.length}`,
+    ``,
     `Количество палиндромных подстрок: ${result.palindromeCount}`,
     `Рекомендация: ${result.recommendation}`
killedBy: resultWriter формирует человекочитаемые строки отчета
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]", "Четные радиусы: [0, 0, 2, 0]", "Наибольший палиндром: abba", "Длина: 4", "Количество палиндромных подстрок: 6", "Рекомендация: Строка содержит крупный палиндромный фрагмент."]
Received:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]

[Killed] StringLiteral
src/io/resultWriter.js:10:5
     `Четные радиусы: [${result.evenRadii.join(", ")}]`,
     `Наибольший палиндром: ${result.longestPalindrome.value}`,
     `Длина: ${result.longestPalindrome.length}`,
-    `Количество палиндромных подстрок: ${result.palindromeCount}`,
+    ``,
     `Рекомендация: ${result.recommendation}`
   ];
killedBy: resultWriter формирует человекочитаемые строки отчета
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]", "Четные радиусы: [0, 0, 2, 0]", "Наибольший палиндром: abba", "Длина: 4", "Количество палиндромных подстрок: 6", "Рекомендация: Строка содержит крупный палиндромный фрагмент."]
Received:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]

[Killed] StringLiteral
src/io/resultWriter.js:11:5
     `Наибольший палиндром: ${result.longestPalindrome.value}`,
     `Длина: ${result.longestPalindrome.length}`,
     `Количество палиндромных подстрок: ${result.palindromeCount}`,
-    `Рекомендация: ${result.recommendation}`
+    ``
   ];
 }
killedBy: resultWriter формирует человекочитаемые строки отчета
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]", "Четные радиусы: [0, 0, 2, 0]", "Наибольший палиндром: abba", "Длина: 4", "Количество палиндромных подстрок: 6", "Рекомендация: Строка содержит крупный палиндромный фрагмент."]
Received:
  ["Исходная строка: abba", "Нечетные радиусы: [1, 1, 1, 1]

[Killed] BlockStatement
src/io/resultWriter.js:15:52
   ];
 }
 
-function printResult(result, logger = console.log) {
-  formatResultLines(result).forEach((line) => logger(line));
-}
+function printResult(result, logger = console.log) {}
 
 function writeResultToFile(result, path) {
killedBy: resultWriter печатает результат в консоль
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  7
Received:
  0

Message:

[Killed] ArrowFunction
src/io/resultWriter.js:16:37
 }
 
 function printResult(result, logger = console.log) {
-  formatResultLines(result).forEach((line) => logger(line));
+  formatResultLines(result).forEach(() => undefined);
 }
 
killedBy: resultWriter печатает результат в консоль
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  7
Received:
  0

Message:

[Killed] BlockStatement
src/io/resultWriter.js:19:42
   formatResultLines(result).forEach((line) => logger(line));
 }
 
-function writeResultToFile(result, path) {
-  fs.writeFileSync(path, JSON.stringify(result, null, 2), "utf8");
-}
+function writeResultToFile(result, path) {}
 
 module.exports = { formatResultLines, printResult, writeResultToFile };
killedBy: resultWriter сохраняет результат в JSON-файл через stub
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:
